app/views/pages/explore.html.erb

    <div class="col-sm-11">
       <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span>---<span class="post-creation"><%= @p.created_at.to_formatted_s(:long) %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]