app/views/pages/home.html.erb

SELECT "posts".* FROM "posts" WHERE (user_id IN (3))  ORDER BY "posts"."created_at" DESC
---
                  <div class="col-sm-6" style="font-size: 80%; opacity: 3;">PUNCHES<br>
                    <h6 style="color: #b40300; font-size: 200%;"><%= current_user.posts.count %></h6>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
    <div class="col-sm-11">
       <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span>---<span class="post-creation"><%= @p.created_at.to_formatted_s(:long) %></span></p>