app/controllers/posts_controller.rb

   def create
       @post = Post.new(post_params)
       @post.user_id = current_user.id # Assign the post to user who created it.
       respond_to do |f|
           if(@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Education is the manifestation of perfection already in man!"], ["user_id", 2], ["created_at", "2017-08-01 04:56:41.693756"], ["updated_at", "2017-08-01 04:56:41.693756"]]